{
  "lng": "enUS",
  "section": {
    "social": "Social",
    "profile": "Profile",
    "education": "Education",
    "skills": "Skills",
    "experience": "Experience",
    "certification": "Certification",
    "language": "Languages",
    "interest": "Interests",
    "pets": "Pets",
    "books": "Books",
    "writings": "Writings",
    "drawings": "Drawings"
  },
  "menu": [
    {
      "id": "home",
      "item": "home",
      "icon": "bx bx-door-open"
    },
    {
      "id": "profile",
      "item": "profile",
      "icon": "bx bxs-user-detail"
    },
    {
      "id": "education",
      "item": "education",
      "icon": "bx bxs-book-open"
    },
    {
      "id": "skills",
      "item": "skills",
      "icon": "bx bx-receipt"
    },
    {
      "id": "experience",
      "item": "experience",
      "icon": "bx bx-desktop"
    },
    {
      "id": "certification",
      "item": "certification",
      "icon": "bx bx-award"
    },
    {
      "id": "languages",
      "item": "languages",
      "icon": "bx bx-comment-dots"
    },
    {
      "id": "interests",
      "item": "interests",
      "icon": "bx bx-like"
    }
  ],
  "consent": {
    "title": "Cookie settings",
    "description": "This website uses cookies to improve functionality and analyze traffic. You can choose which types of cookies to accept below.",
    "acceptAll": "Accept all",
    "acceptSelection": "Accept selection",
    "rejectAll": "Reject all",
    "necessary": "Necessary",
    "analytics": "Analytics",
    "preferences": "Preferences",
    "marketing": "Marketing"
  },
  "profile": {
    "name": "Leticia Vasconcellos",
    "profession": "Full stack Developer",
    "location": "Taboão da Serra - SP, Brazil",
    "location_icon": "bx bxs-map-pin",
    "email": "leticiavasconcellos@yahoo.com",
    "email_icon": "bx bx-envelope",
    "phone": "+55 11 9 4844-2463",
    "phone_icon": "bx bx-phone",
    "summary": "I'm a Full-Stack Developer with over 15 years of experience, focusing on .NET and JavaScript frameworks. My career has been dedicated to building both web and desktop applications, with a strong foundation in database management.| I value the principles of Agile and Scrum, which guide my approach to development – practical, efficient, and always evolving. Continual learning and adapting to new technologies are integral parts of my professional growth.| My objective is to develop solutions that are not only effective but also user-friendly. In collaboration with teams, I aim to contribute to projects that make a real difference."
  },
  "social": [
    {
      "name": "linkedin",
      "icon": "bx bxl-linkedin-square",
      "url": "https://www.linkedin.com/in/leticiavasconcellos",
      "handler": "@leticiavasconcellos"
    },
    {
      "name": "github",
      "icon": "bx bxl-github",
      "url": "https://github.com/lvasconcellos",
      "handler": "@lvasconcellos"
    },
    {
      "name": "discord",
      "icon": "bx bxl-discord-alt",
      "url": "https://discord.com/users/717408919714267199",
      "handler": "@lvasconcellos"
    }
  ],
  "education": {
    "institution": "Descomplica Faculdade Digital",
    "course": "Bachelor’s degree in data science",
    "date": "2023 - 2025",
    "details": [
      {
        "studies": "Business Communication • Applications and Systems Development • Design Thinking and Agile Methodologies",
        "course": "Developer Thinking",
        "date": "Nov 2023"
      },
      {
        "studies": "Coaching and Career Planning • Integrative Practice for Data Intelligence",
        "course": "Programming and Communication",
        "date": "Sep 2023"
      },
      {
        "studies": "Computer Architecture • Applied Differential Equations",
        "course": "Math Computing Basics",
        "date": "May 2023"
      }
    ]
  },
  "skills": [
    {
      "group": "C# , VB.NET"
    },
    {
      "group": "ASP.NET MVC, ASP.NET Web API, .NET Core"
    },
    {
      "group": "SQL Server, Oracle, MySQL, PostgreSQL, MongoDB"
    },
    {
      "group": "HTML, CSS, JavaScript, jQuery, Bootstrap"
    },
    {
      "group": "Angular, React, TypeScript"
    },
    {
      "group": "Unit Testing, CI/CD (GitLab)"
    },
    {
      "group": "Scrum, Kanban"
    },
    {
      "group": "Power BI, ETL (Talend, Data Factory)"
    }
  ],
  "experience": [
    {
      "company": "Stefanini Brasil",
      "role": "Software Developer",
      "date": "March 2022 - Present",
      "description": "Engaged in full-stack development, specializing in .NET and Angular, and employing TypeScript for enhanced Angular projects.| Acquired experience with advanced message queue technologies, such as RabbitMQ and MassTransit, for efficient data handling and service communication.| Utilized MediatR for improved communication patterns in REST API developments, contributing to more efficient and maintainable code.| Participated in DevOps activities, including CI/CD pipeline maintenance and vulnerability scanning, to uphold high standards of application security and reliability.| Managed Oracle databases, focusing on optimizing data structures and query performance, thereby improving system functionality and efficiency.| Introduced to Agile Scrum methodology, enhancing my project management skills and team collaboration.| Utilized TFS Dashboard and Jira for efficient project tracking and management, streamlining the workflow and task organization.| Maintained project documentation using Confluence, ensuring that project knowledge was well-organized and accessible to the team."
    },
    {
      "company": "Agência Molla",
      "role": "Software Developer",
      "date": "March 2021 - March 2022",
      "description": "Developed multiple websites employing Razor, JavaScript, C#, MS SQL, and also worked with jQuery. These projects improved my front-end development capabilities and reinforced my back-end skills.| Maintained and upgraded ASP MVC applications, gaining deeper insights into modernizing and enhancing legacy systems.| Acquired practical experience with cloud technologies, IIS, and automation through Power Automate, adding to my versatility as a developer."
    },
    {
      "company": "Grupo Ease",
      "role": "Software Developer",
      "date": "Jul 2019 - March 2021",
      "description": "Enhanced desktop ERP and ASP MVC systems, focusing on improving user interface and functionality. This role advanced my system analysis and design capabilities.| Gained valuable experience in ETL processes with PostgreSQL and Azure databases, integrating Talend and Data Factory, which enhanced my data processing skills. | First introduction to working in a team environment and was introduced to the Kanban methodology, which greatly improved my project management and collaborative skills."
    },
    {
      "company": "LTS - Soluções Tecnológicas",
      "role": "Software Developer",
      "date": "Apr 2011 - Jul 2019",
      "description": "Led the development of 'Consulte', a desktop application for automated data capture and validation, refining my application development and problem-solving skills.| Played a key role in providing user support and training, enhancing my ability to communicate technical concepts effectively to non-technical users.| Developed and maintained various desktop applications using VB.NET, balancing user needs with technical requirements to deliver practical solutions.| Gained extensive experience in web technologies, including ASP and HTML, and database management with MS SQL and MySQL.| Involved in installation and setup activities for WinForms and ASP WebForms projects, ensuring smooth deployment and functionality."
    },
    {
      "company": "CIVS - Assessoria Sindical",
      "role": "Jr Software Developer",
      "date": "June 2005 - Ago 2010",
      "description": "Transitioned from an office assistant to a developer role, addressing the company's need for a customized system, marking my initial step into software development.| Learned to work with MS Office, mastering advanced features in Excel and Access, which played a crucial role in my early development tasks.| Gained skills in analyzing and validating data, understanding the importance of accuracy and integrity in software solutions.| Developed foundational skills in software development, including migrating the custom system from Access VBA to VB.NET and MS SQL, laying the groundwork for my future career in technology."
    }
  ],
  "certification": [
    {
      "institution": "Udemy",
      "course": ".NET Microservices: CQRS & Event Sourcing with Kafka",
      "date": "Apr 2023",
      "description": "Focused on learning Kafka and Docker within a .NET framework, gaining insights into CQRS and Event Sourcing, and enhancing my understanding of microservices architecture."
    },
    {
      "institution": "Fundação Vanzolini",
      "course": "Agile Scrum Master",
      "date": "Mar 2022",
      "description": "Acquired foundational knowledge and practical skills in Scrum methodologies, which complemented my experience with agile practices in software development."
    },
    {
      "institution": "Code With Mosh",
      "course": "The Complete ASP.NET MVC 5 Course",
      "date": "Jan 2022",
      "description": "Deepened my expertise in ASP.NET MVC, focusing on advanced features and best practices to enhance web application development skills."
    },
    {
      "institution": "Udemy",
      "course": "Unit Testing for C#  Developers",
      "date": "Sep 2021",
      "description": "Gained comprehensive knowledge in unit testing for C#, emphasizing the importance of testing in ensuring code quality and application reliability."
    },
    {
      "institution": "Impacta Tecnologia",
      "course": "SQL 2008",
      "date": "Dec 2010",
      "description": "Strengthened my SQL Server skills, focusing on fundamental concepts and practical applications in database management."
    },
    {
      "institution": "Impacta Tecnologia",
      "course": "VB.NET 2005",
      "date": "Jul 2009",
      "description": "Entered the realm of programming with VB.NET, building a foundational understanding of programming concepts and application development."
    }
  ],
  "languages": [
    {
      "language": "Portuguese",
      "level": "Native"
    },
    {
      "language": "English",
      "level": "Proficient"
    }
  ],
  "interests": [
    {
      "icon": "bx bxs-cat",
      "interest": "Pets"
    },
    {
      "icon": "bx bxs-book-content",
      "interest": "Writing"
    },
    {
      "icon": "bx bxs-paint",
      "interest": "Drawing"
    },
    {
      "icon": "bx bxs-book-bookmark",
      "interest": "Books"
    }
  ],
  "pets": [
    {
      "name": "Sombra",
      "type": "Dog",
      "description": "My most happy-go-lucky boy. Even at 9 years old, he loves to play with his toys.",
      "photo": "../img/sombra.jpg"
    },
    {
      "name": "Shaggy",
      "type": "Dog",
      "description": "The oldest and wisest of the bunch. He loves to cuddle and sleep on my lap.",
      "photo": "../img/shaggy.jpg"
    },
    {
      "name": "Otto",
      "type": "Dog",
      "description": "I don't know where he finds the energy to jump around all day. At 9 years old, he's still a puppy at heart.",
      "photo": "../img/otto.jpg"
    },
    {
      "name": "Vinagre",
      "type": "Cat",
      "description": "My little work-buddy, no typo gets by him and no flying toys either. He's always ready to play fetch.",
      "photo": "../img/vinagre.jpg"
    },
    {
      "name": "Milu",
      "type": "Cat",
      "description": "He would never ask a mirror who's the fairest of them all. He is already confident that he is.",
      "photo": "../img/milu.jpg"
    },
    {
      "name": "Canela",
      "type": "Cat",
      "description": "My only girl and the queen of the house. She has all the boys in the palm of her paw.",
      "photo": "../img/canela.jpg"
    }
  ],
  "books": [
    {
      "name": "The Power of Habit",
      "type": "Personal Development",
      "description": "Mind-blowing book. The science of human psychology is always fascinating to me.",
      "photo": "../img/book01.jpg"
    },
    {
      "name": "Nonviolent Communication",
      "type": "Social Sciences",
      "description": "Perfect opportunity to leave judgment aside and be open to new perspectives.",
      "photo": "../img/book02.jpg"
    },
    {
      "name": "The Things We Do for Love",
      "type": "Genre Fiction",
      "description": "The story hits my soft spot for unconventional love stories. Some love stories are not about romance.",
      "photo": "../img/book03.jpg"
    },
    {
      "name": "The Witness",
      "type": "Women's Fiction",
      "description": "Another thing I love in a story is the complex character. So many feelings and so many layers to enjoy.",
      "photo": "../img/book04.jpg"
    },
    {
      "name": "Clean Code",
      "type": "Programming & Software Development",
      "description": "I'm a sucker for clean code. I love to read about it and I love to write it.",
      "photo": "../img/book05.jpg"
    },
    {
      "name": "Going Rogue",
      "type": "Mystery",
      "description": "I am addicted to the whole series. Looking for amazing dialog, smart plots, and funny characters? Look no further. The Stephanie Plum series is a must-read.",
      "photo": "../img/book06.jpg"
    },
    {
      "name": "Why Has Nobody Told Me This Before?",
      "type": "Psychology & Mental Health",
      "description": "I've been in therapy for the past 3 years and this book is a great complement to it. It's a great read for anyone who wants to understand themselves better.",
      "photo": "../img/book07.jpg"
    }
  ],
  "writings": [
    {
      "name": "The 22 Days",
      "type": "Short Story",
      "description": "I'm home! He called out as he walked through the door. He went to the couch and flopped down, immediately taking off his dirty boots. Tired, he leaned back, letting his heavy breath out while he waited.| A minute went by and he looked around, still waiting, You hear me? He pointed his face up, trying to hear sounds. Confused at the silence, he got up and went to the kitchen. He narrowed his eyes at the empty clean space. There should be pots on the stove, something cooking in the oven.| The next place he checked, were the bedrooms. First his kid's, then his own. Everything was empty, quiet and empty. Angry, he put his boots back on, grabbed his keys and headed to his truck."
    },
    {
      "name": "Screamin' in Silence",
      "type": "Long Story",
      "description": "In the New York Police Department's reception area, phones ring incessantly, and the relentless clatter of keyboards drowns out the hum of many conversations. The space, not particularly spacious, buzzes with the energy of laughter, footsteps, and the occasional slamming door. Amidst this cacophony, focusing on a single scene is impossible, but it's not necessary either. Here, the remarkable feature is the silence.| Just past the reception, down a hallway adorned with plaques and pictures honoring past heroes and teams, sits a gray door. Behind it, the silence is so complete it almost suggests abandonment.| Inside, the woman at the desk is a study in concentration. She lifts a photograph, holding it up to the light, her eyes darting between it and the plethora of others scattered across her desk. There's a detail that catches her attention, a pattern that subtly repeats itself in each image.| As she contemplates the potential significance of this finding, a low but firm knock at the door interrupts the stillness. She doesn't respond, her focus unwavering on the photographs. The knocking persists, a second, then a third time. Each knock is deliberately ignored, her attention fixed on the task at hand.| Minutes pass before the door finally opens, admitting an uninvited guest. She perceives his presence without looking up. Two steps in, and she's already cataloged his brown waxed cotton jacket, dark blue jeans, and the leather wingtips, size 9.5. She even notes the small, reddish scar on his left cheek, likely a result of a distracted shaving incident. However, she doesn’t bother to lift her head or acknowledge him in any way.| His prolonged silence is almost admirable, but the fact that he dares to enter her office without invitation stifles any fleeting sense of appreciation. Finally, without shifting her gaze from the photographs, she speaks. 'I don't care about the first part or the second. The only thing I really want to know is why you're still standing in front of me.'| As she talks, her hands remain busy, picking up two more photographs, examining them briefly before setting them back down. Then, with a pen in hand, she scribbles a note on a sheet already filled with her hurried handwriting inside the case folder."
    },
    {
      "name": "The Letters",
      "type": "Short Story",
      "description": "'What does it say?' I asked Angie, covering my eyes as I handed the stick to her. She didn't respond right away, which made me part my fingers to look at her. '...Angie?'| 'There are... two lines.' Her face was so serious it made me even more nervous.| 'And that means what?' I took the stick back as if the answer was in it.| Angie picked up the box, 'It's positive. You're pregnant.'| My legs buckled and I felt around the bathroom until I found the toilet seat and sat down. I couldn't even breathe.| 'What you gonna do?' I heard Angie ask, but still, it took me a while to focus on her again.| I shook my head to clear my mind, then looked at her, 'What you mean, what I'm gonna do?'| 'I mean, are you keeping it?'| I frowned, 'What the hell Angie, I'm not getting rid of it, why would I do that?'| 'Well, sorry, but you're not exactly the maternal type.' Angie threw her hands up, defensively.| It was probably true, and I definitely didn't see myself being a mom so soon. I knew for a fact I wasn't ready for it, but hey... maybe that was nature telling me something. Like... maybe my body was ready for it, even if my mind wasn't, or that maybe I should not be counting on condoms alone to prevent pregnancy.| 'So you're telling him?'| Once again, Angie made me frown, 'Of course I'm telling him. He's the father. I can't have a baby without telling him.'| She kind of whistled, 'Man, that's crazy, you guys been seeing each other for what? 2 months? You think there's any chance he'll react well to the news?'| 'Well, he better be glad I'm willing to pop out his child, 'cause I'm damn well not going through this alone. I wouldn't be going through this at all if it wasn't for him.'| 'You were very much a willing participant though...' Angie shrugged.| 'Ugh, I'm going back to bed, I'm done with this day. I want a different one.'"
    },
    {
      "name": "Before he leaves",
      "type": "Poem",
      "description": "I want a hug in the morning, I want to run away from home, I want to lie,| I want to laugh at a fight, be partners in crime,| Climb up high and enjoy the taste, the bittersweet of the time.| I want to visit a grave... of a friendship, knowing it will never die.| I want him to hold my hand, share with me all he has, the new and old laughs,| I want to dance, have a party in the rain, to the songs in our heads.| I want to share with him my secrets, my time,| Bury our treasures, where only we'll both find.| I want to look at the sky and promise to never forget,| Promise to be back, and I want a hug goodnight.| I want memories of a good day, instead of a goodbye."
    }
  ],
  "drawings": [
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing01.png"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing02.jpg"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing03.jpg"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing04.jpg"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing05.jpg"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing06.jpg"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing07.jpg"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing08.png"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing09.jpg"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing10.jpg"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing11.png"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing12.png"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing13.jpg"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing14.png"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing15.jpg"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing16.png"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing17.jpg"
    },
    {
      "type": "Vector",
      "photo": "../img/drawing18.jpg"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing19.jpg"
    },
    {
      "type": "Hand-drawn",
      "photo": "../img/drawing20.jpg"
    }
  ]
}
